Revit 2026 API

# WoodWoodColor2 Property

---

The property labeled "Color 2" from the "Wood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodColor2 { get; }
```
```vb
Public Shared ReadOnly Property WoodColor2 As String
	Get
```
```cpp
public:
static property String^ WoodColor2 {
	String^ get ();
}
```
```fsharp
static member WoodColor2 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Wood Class

Autodesk.Revit.DB.Visual Namespace